.config/emacs/emacs.org
* Device Specific Configuration
This is where I make a bunch of named code blocks to noweb into other code blocks.
I find it more convenient to have them all here since if I change one of them, I'll usually change all of them.

#+NAME: Org-Path
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Documents/Org")
#+END_SRC

#+NAME: Org-Preview-Latex-image-Directory-Path
#+BEGIN_SRC emacs-lisp
;; This just sets where the images are stored for LaTeX.
(setq org-preview-latex-image-directory "~/Documents/ltximg/")
#+END_SRC

** Capture Templates
#+NAME: Org-Capture-Templates-Config
#+BEGIN_SRC emacs-lisp
  ;; Capture templates
  ;; I had an error here where I was concatenating the org-directory to
  ;; the file, but if you do not specify an absolute path, all
  ;; paths are relative to the org-directory path
  (setq org-capture-templates
        '(("t" "Todo" entry
           (file+headline "Inbox.org" "Inbox")
           "** TODO %^{Task}\n:PROPERTIES:\n:CREATED: %U\n:CAPTURED: %a\n:END:\n%?")

          ("f" "Fleeting" entry
           (file+headline "Ideas.org" "Fleeting")
           "** IDEA %^{Idea}\n:PROPERTIES:\n:CREATED: %U\n:CAPTURED: %a\n:END:\n%?")

          ("d" "Deadline" entry
           (file+headline "Calendar.org" "Deadlines")
           "** TODO %^{task}\ndeadline: %^{deadline}t\n:properties:\n:created: %u\n:captured: %a\n:end:\n%?")

          ("p" "Project" entry
           (file+headline "Projects.org" "Projects")
           "* PROJ %^{Project name}\n:PROPERTIES:\n:CREATED: %U\n:CAPTURED: %a\n:END:\n** TODO %?")

          ("i" "Idea" entry
           (file+headline "Ideas.org" "Ideas")
           "** IDEA %^{Idea}\n:PROPERTIES:\n:CREATED: %U\n:CAPTURED: %a\n:END:\n%?")

          ))
#+END_SRC

#+NAME: Org-Roam-Capture-Templates-Config
#+BEGIN_SRC emacs-lisp
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?" :target
           (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n:PROPERTIES:\n:CREATED: %U\n:END:\n")
           :unnarrowed t)

          ("l" "Literature" plain "%?"  :if-new
           (file+head "Literature/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n:PROPERTIES:\n:CREATED: %U\n:END:\n")
           :unnarrowed t)))

#+END_SRC

** Custom Keybinds
#+NAME: Global-Org-Agenda-Keybinds
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-S-o") 'org-agenda)
#+END_SRC

#+NAME: Global-Org-Capture-Keybinds
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-S-c") 'org-capture)
#+END_SRC

#+NAME: Global-Org-Roam-Dailies-Keybinds
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-;") 'org-roam-dailies-goto-today)
#+END_SRC

#+NAME: Org-Roam-Dailies-Keybinds
#+BEGIN_SRC emacs-lisp
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
#+END_SRC

