.config/emacs/emacs.org
* config.el
:PROPERTIES:
:header-args: :tangle config.el
:END:

I had some errors when trying to render LaTeX inline, and I found that my problem was my imagemagick pathing wasn't being added in my shell correctly, so I make sure to include the needed environment variables in emacs.
#+NAME: Configure-Shell-Binaries
#+BEGIN_SRC emacs-lisp
  ;; This makes it so emacs knows where to look for files.
  (use-package exec-path-from-shell
    :ensure t)
  (require 'exec-path-from-shell)
  (when (memq window-system '(mac ns x))
    (setq exec-path-from-shell-variables '("PATH" "MANPATH" "MAGICK_HOME" "DYLD_LIBRARY_PATH"))
    (exec-path-from-shell-initialize))
  (exec-path-from-shell-initialize)
  (setq custom-file "custom-vars.el")    ;; Specify the custom file path.
  (load custom-file 'noerror 'nomessage) ;; Load the custom file quietly, ignoring errors.

#+END_SRC

** org-config
:PROPERTIES:
:header-args: :tangle config.el
:END:

This is where I set up my Org-Config.
#+NAME: Org-Config
#+BEGIN_SRC emacs-lisp :noweb yes
  <<Org-Path>>

  (use-package org
    :ensure nil     ;; This is built-in, no need to fetch it.
    :defer t)       ;; Defer loading Org-mode until it's needed.

  ;;; Ensure org mode is loaded
  (require 'org)

  ;; This tells emacs where to reference files for org-agenda.
  (setq org-agenda-files (file-expand-wildcards (concat org-directory "/*.org")))

  <<Global-Org-Agenda-Keybinds>>

  ;;; Set the default file for general notes/captures
  (setq org-default-notes-file (concat org-directory "/Ideas.org"))

  (message (concat org-directory "/Inbox.org"))


  <<Org-Capture-Templates-Config>>

  <<Global-Org-Capture-Keybinds>>

  ;; This sets the files that refile can refile into. Maxlevel sets the number of subheadings refile can take.
  (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))

#+END_SRC

This is where I configure my org-roam.
#+NAME: Org-Roam-Config
#+BEGIN_SRC emacs-lisp :noweb yes
  <<Org-Roam-Capture-Templates-Config>>

    ;; Modified from here: https://systemcrafters.net/build-a-second-brain-in-emacs/keep-a-journal/
    (use-package org-roam
      :ensure t
      :init
      (setq org-roam-v2-ack t)
      :custom
      (org-roam-directory (concat org-directory "/roam"))
      (org-roam-completion-everywhere t)
      (org-roam-dailies-capture-templates
        '(("d" "default" entry ""
           :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n:PROPERTIES:\n:CREATED: %U\n:END:\n"
                              ))))
<<Org-Roam-Dailies-Keybinds>>
      :config
      (require 'org-roam-dailies) ;; Ensure the keymap is available
      (org-roam-db-autosync-mode))

<<Global-Org-Roam-Dailies-Keybinds>>

  #+END_SRC

** LaTeX-config

This is where I configure my LaTeX to work properly inline using tectonic and imagemagick.
I also make sure to set where to put all of the image preview files so I can delete them if they eat my storage.
#+NAME: Latex-Config  
#+BEGIN_SRC emacs-lisp :noweb yes
  <<Org-Preview-Latex-image-Directory-Path>>
  (add-to-list 'org-preview-latex-process-alist
               '(tectonic :programs ("tectonic" "convert")
                          :description "pdf > png"
                          :message "Ensure tectonic and imagemagick are installed."
                          :image-input-type "pdf"
                          :image-output-type "png"
                          :image-size-adjust (1.0 . 1.0)
                          :latex-compiler
                          ("tectonic -Z shell-escape-cwd=%o --outfmt pdf --outdir %o %F")
                          :image-converter
                          ("convert -density 192 -trim -background white -alpha remove %F %O")
                          :transparent-image-converter
                          ("convert -density 192 -trim -background none %F %O")))

  (setq org-preview-latex-default-process 'tectonic)

#+END_SRC

** Colors-config
:PROPERTIES:
:header-args: :tangle config.el
:END:

This is where I store my modifications to the theming of emacs.
I do not currently do much of anything with them, but I do plan to make a few modifications to it in the future.
#+BEGIN_SRC emacs-lisp :tangle no
(set-frame-parameter nil 'alpha-background 70)
(add-to-list 'default-frame-alist '(alpha-background . 70))
#+END_SRC

* Misc Config
:PROPERTIES:
:header-args: :tangle config.el
:END:

This is just a couple of the random initializations that I like to do.
#+NAME: Initialization
#+BEGIN_SRC emacs-lisp
    ;; This just maximizes the window.
    (toggle-frame-maximized)

    ;; This makes it so text wraps globally.
    (global-visual-line-mode)
#+END_SRC
