.config/emacs/config.el
      (require 'org-roam-dailies) ;; Ensure the keymap is available
      (org-roam-db-autosync-mode))

(global-set-key (kbd "C-;") 'org-roam-dailies-goto-today)

;; This just sets where the images are stored for LaTeX.
(setq org-preview-latex-image-directory "~/Documents/ltximg/")
(add-to-list 'org-preview-latex-process-alist
             '(tectonic :programs ("tectonic" "convert")
                        :description "pdf > png"
                        :message "Ensure tectonic and imagemagick are installed."
                        :image-input-type "pdf"
                        :image-output-type "png"
                        :image-size-adjust (1.0 . 1.0)
                        :latex-compiler
                        ("tectonic -Z shell-escape-cwd=%o --outfmt pdf --outdir %o %F")
                        :image-converter
                        ("convert -density 192 -trim -background white -alpha remove %F %O")
                        :transparent-image-converter
                        ("convert -density 192 -trim -background none %F %O")))

(setq org-preview-latex-default-process 'tectonic)

;; This just maximizes the window.
(toggle-frame-maximized)

;; This makes it so text wraps globally.
(global-visual-line-mode)
